#include "ft_printf.h"

int main()
{
	// -, 0, .*, *
	printf("!%-.10d!\n",42);
	// printf("X!%-0d!\n",42);//x
	printf("!%-10d!\n",42);
	printf("!%-*.10d!\n",4,42);
	printf("!%-*d!\n",3,42);
	printf("!%-.*d!\n",3,42);
	printf("-1-\n");
	// printf("X!%-0d!\n",3,42);//x
	// printf("X!%-0.*d!\n",3,42);//x
	// printf("X!%-0.d!\n",42); //x
	printf("!%10.20d!\n",42);
	printf("!%10.5d!\n",42);
	printf("!%-10.5d!\n",42);
	printf("-------------------------------\n");
	printf("!%-.10d!\n",-42);
	// printf("X!%-0d!\n",-42);//x
	printf("!%-10d!\n",-42);
	printf("!%-*.10d!\n",4,-42);
	printf("!%-*d!\n",3,-42);
	printf("-2-\n");
	printf("!%-.*d!\n",3,-42);
	// printf("X!%-0.*d!\n",3,-42);//x
	// printf("X!%0-.*d!\n",3,-42);//x
	// printf("X!%-0.d!\n",3,-42);//x
	printf("!%10.20d!\n",-42);
	printf("------------Size를 기준으로 생각해보자-----------------\n");
	printf("|너비|정확도|길이|\n");
	printf("| 9 | 7 | 5 | :%9.7d\n",12345);
	printf("| 9 | 3 | 5 | :%9.3d\n",12345);
	printf("| 3 | 9 | 5 | :%3.9d\n",12345);
	printf("| 7 | 9 | 5 | :%7.9d\n",12345);
	printf("| 4 | 3 | 5 | :%4.3d\n",12345);
	printf("| 3 | 4 | 5 | :%3.4d\n",12345);
	printf("-------------마이너스 값이 들어올 때를 기준으로 생각해보자-----------------\n");
	printf("| 9 | 7 | 5 | :%9.7d\n",-1234);
	printf("| 9 | 3 | 5 | :%9.3d\n",-1234);
	printf("| 3 | 9 | 5 | :%3.9d\n",-1234);
	printf("| 7 | 9 | 5 | :%7.9d\n",-1234);
	printf("| 4 | 3 | 5 | :%4.3d\n",-1234);
	printf("| 3 | 4 | 5 | :%3.4d\n",-1234);

	return (0);
}
